import { Context } from "@maxhub/max-bot-api";
import { ARMarketReviewsKeyboard, toAnalysticResearchChildKeyboard, toAnalysticResearchKeyboard } from "../keyboards/analysticResearch";


// Опросы и исследования
export async function getAnalysticResearch(ctx: Context){
    await ctx.reply(
`📈 <b>Опросы и исследования</b>

Участвуйте в исследованиях и влияйте на развитие кадровой политики, образовательных программ и господдержки бизнеса.  
`,{
    attachments: [toAnalysticResearchKeyboard],
    format: 'html'
}
    )
}


//Всероссийский опрос работодателей
export async function getARRussuinSurvey(ctx: Context){
    await ctx.reply(
`📊 <b>Всероссийский опрос работодателей</b>

Ваше мнение формирует кадровую стратегию страны!  

<b>Государство использует данные опроса для:</b>  
📌 Корректировки программ обучения под запросы бизнеса  
📌 Прогнозирования дефицита специалистов  
📌 Распределения бюджетных мест в вузах и колледжах  

<b>Кто может участвовать?</b>
Все организации и ИП – независимо от размера и сферы деятельности.  

<b>Сроки проведения: </b> 
Ежегодно с 1 марта по 30 апреля на портале «Работа России»
`,{
    attachments: [toAnalysticResearchKeyboard],
    format: 'html'
}
    )
}

// Обзоры рынка труда
export async function getARMarketReviews(ctx:Context){
    await ctx.reply(
`🔍 <b>Обзоры рынка труда</b>

Актуальная статистика рынка труда Мурманской области – в наших обзорах.  
`,
{
    attachments: [ARMarketReviewsKeyboard],
    format: 'html'
}
    )
}

//Другие опросы и исследования
export async function getAROtherSurveys(ctx:Context){
    await ctx.reply(
`📡 <b>Другие опросы и исследования</b>

Сейчас новых опросов нет. Следите за обновлениями – сообщим здесь о новых возможностях!  
`,
{
    attachments: [toAnalysticResearchChildKeyboard],
    format: 'html'
}
    )
}